Edragon/WCH/CH56x/official examples/CH563_SDCARD_FAT/CH563_SDCARD_FAT/SRC/CH563SFR.H
/********************************** (C) COPYRIGHT *******************************
* File Name          : CH563SFR.H
* Author             : WCH
* Version            : V1.0
* Date               : 2013/11/15
* Description        : SpecialFunctionRegister
*******************************************************************************/



/******************************************************************************/
#include "CH563BAS.H"
#ifndef __CH563SFR_H__
#define __CH563SFR_H__

#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************/

// Address Space
//   CODE:   00000000H - 000FFFFFH, 1MB
//    SFR:   00400000H - 0040FFFFH, 64KB
//   DATA:   00808000H - 0081FFFFH, 96KB/64KB/32KB
//   XBUS:   00C00000H - 00CFFFFFH, 1MB
//  OTHER:   00E00000H - FFFFFFFFH, undefined
//
//    SFR:   00400000H - 0040FFFFH, 64KB
//      SYS:    +1000H - 1FFFH, include base config, interrupt, GPIO, etc...
//      USB:    +4000H - 5FFFH
//      ETH:    +6000H - 7FFFH
//      TMR0:   +8000H - 83FFH
//      TMR1:   +8400H - 87FFH
//      TMR2:   +8800H - 8BFFH
//      TMR3:   +8C00H - 8FFFH
//      ADC:    +A000H - AFFFH
//      SPI0:   +C000H - C7FFH
//      SPI1:   +C800H - CFFFH
//      UART0:  +D000H - D7FFH
//      UART1:  +D800H - DFFFH

// Register Bit Attribute / Bit Access Type
//   RF:    Read only for Fixed value
//   RO:    Read Only (internal change)
//   RZ:    Read only with auto clear Zero
//   WO:    Write Only (read zero or different)
//   WA:    Write only under safe Accessing mode (read zero or different)
//   WZ:    Write only with auto clear Zero
//   RW:    Read / Write
//   RWA:   Read / Write under safe Accessing mode
//   RW1:   Read / Write 1 to Clear

/* Register name rule:
   R32_* for 32 bits register (UINT32,ULONG)
   R16_* for 16 bits register (UINT16,USHORT)
   R8_*  for  8 bits register (UINT8,UCHAR)
   RB_*  for bit or bit mask of 8 bit register
   BA_*  for base address point
   Others for register address offset */

/* ********************************************************************************************************************* */

/* System: safe accessing register */
#define R32_SAFE_ACCESS     (*((PUINT32V)0x00400000)) // RW, safe accessing
#define R8_SAFE_ACCESS_SIG  (*((PUINT8V)0x00400000))  // WO, safe accessing sign register, must write 0x57 then 0xA8 to enter safe accessing mode
#define  RB_SAFE_ACC_MODE   0x03                      // RO, current safe accessing mode: 11=safe/unlocked (SAM), other=locked (00..01..10..11)
#define  RB_SAFE_ACC_TIMER  0x70                      // RO, safe accessing timer bit mask (16*clock number)
#define R8_SAFE_ACCESS_ID   (*((PUINT8V)0x00400002))  // RF, safe accessing ID register, always 0x01
#define R8_WDOG_CLEAR       (*((PUINT8V)0x00400003))  // WO, clear watch-dog

/* System: global configuration register */
#define R32_GLOBAL_CONFIG   (*((PUINT32V)0x00400004)) // RW, global configuration
#define R8_GLOB_MEM_CFG     (*((PUINT8V)0x00400004))  // RWA, global memory configuration, SAM and bit7:6 must write 1:0
#define  RB_GLOB_MEM_CFG    0x03                      // RWA, global memory config: 10=C96K/D32K, 11=C32K/D96K, 00/01=C64K/D64K
#define  RB_GLOB_BOOT_APP   0x10                      // RO, boot loader action status
#define  RB_GLOB_CFG_FLAG   0x80                      // RO, global config flag
#define R8_GLOB_LOCK_PORT   (*((PUINT8V)0x00400005))  // RWA, lock port configuration, SAM and bit7:6 must write 0:0
#define  RB_GLOB_LOCK_PA    0x01                      // RWA, lock GPIO PA
#define  RB_GLOB_LOCK_PB    0x02                      // RWA, lock GPIO PB
#define  RB_GLOB_LOCK_PD    0x08                      // RWA, lock GPIO PD
#define R8_GLOB_RST_CFG     (*((PUINT8V)0x00400006))  // RWA, global reset configuration, SAM and bit7:6 must write 0:1
#define  RB_GLOB_FORCE_RST  0x01                      // WA/WZ, force global reset, high action, auto clear
#define  RB_GLOB_WDOG_EN    0x02                      // RWA, watch-dog enable
#define  RB_GLOB_DEBUG_EN   0x20                      // RO, debug enable status
#define R8_GLOB_RESET_KEEP  (*((PUINT8V)0x00400007))  // RW, value keeper during global reset

/* System: PLL configuration register */
#define R32_PLL_CONFIG      (*((PUINT32V)0x00400008)) // RWA, PLL configuration, SAM
#define R8_PLL_EXT_CFG      (*((PUINT8V)0x00400008))  // RWA, PLL external(外部) config, SAM and bit7:6 must write 0:1
#define  RB_PLL_XT_FREQ     0x04                      // RWA, PLL external crystal(晶体) frequency (USB clock): 1=30MHz, 0=12MHz
#define  RB_PLL_ETH_OSC     0x08                      // RWA, PLL ethernet(以太网) clock source: 0=PLL, 1=external crystal
#define R8_PLL_OUT_DIV      (*((PUINT8V)0x00400009))  // RWA, PLL output clock divider, SAM and bit7:6 must write 1:0
#define  RB_PLL_ETH_DIV     0x0F                      // RWA, PLL ethernet clock divider
#define  RB_PLL_SYS_DIV     0x30                      // RWA, PLL system clock divider
#define R8_PLL_PRE_DIV      (*((PUINT8V)0x0040000A))  // RWA, PLL pre-divider(预分频器), SAM, only low 3 bit
#define R8_PLL_LOOP_DIV     (*((PUINT8V)0x0040000B))  // RWA, PLL loop divider, SAM, only low 6 bit
// REF_FREQ = RB_PLL_XT_FREQ / R8_PLL_PRE_DIV, 5MHz ~ 30MHz
// VCO_FREQ = REF_FREQ * R8_PLL_LOOP_DIV, 100MHz ~ 300MHz
// ETH_FREQ = VCO_FREQ / RB_PLL_ETH_DIV, 25MHz
// SYS_FREQ = VCO_FREQ / RB_PLL_SYS_DIV, 20MHz ~ 125MHz
// default: VCO_FREQ = XT_30MHz / 3 * 25 = 250MHz, SYS_FREQ = VCO_FREQ / 4 = 62.5MHz
//          VCO_FREQ = XT_12MHz / 3 * 25 = 100MHz, SYS_FREQ = VCO_FREQ / 4 = 25MHz

/* System: sleep control register */
#define R32_SLEEP_CONTROL   (*((PUINT32V)0x0040000C)) // RWA, sleep control, SAM
#define R8_SLP_CLK_OFF0     (*((PUINT8V)0x0040000C))  // RWA, sleep clock off control byte 0, SAM
#define  RB_SLP_CLK_TMR0    0x01                      // RWA, sleep TMR0 clock
#define  RB_SLP_CLK_TMR1    0x02                      // RWA, sleep TMR1 clock
#define  RB_SLP_CLK_TMR2    0x04                      // RWA, sleep TMR2 clock
#define  RB_SLP_CLK_TMR3    0x08                      // RWA, sleep TMR3 clock
#define  RB_SLP_CLK_SPI0    0x10                      // RWA, sleep SPI0 clock
#define  RB_SLP_CLK_SPI1    0x20                      // RWA, sleep SPI1 clock
#define  RB_SLP_CLK_UART0   0x40                      // RWA, sleep UART0 clock
#define  RB_SLP_CLK_UART1   0x80                      // RWA, sleep UART1 clock
#define R8_SLP_CLK_OFF1     (*((PUINT8V)0x0040000D))  // RWA, sleep clock off control byte 1, SAM
#define  RB_SLP_CLK_ADC     0x10                      // RWA, sleep ADC clock
#define  RB_SLP_CLK_GPIO    0x20                      // RWA, sleep GPIO clock
#define  RB_SLP_CLK_USB     0x40                      // RWA, sleep USB clock
#define  RB_SLP_CLK_ETH     0x80                      // RWA, sleep ethernet clock
#define R8_SLP_WAKE_CTRL    (*((PUINT8V)0x0040000E))  // RWA, wake control, SAM
#define  RB_SLP_PA_WAKE     0x01                      // RWA, enable GPIO PA waking
#define  RB_SLP_PB_WAKE     0x02                      // RWA, enable GPIO PB waking
#define  RB_SLP_PD_WAKE     0x08                      // RWA, enable GPIO PD waking
#define  RB_SLP_USB_WAKE    0x10                      // RWA, enable USB waking
#define  RB_SLP_AP_WAK_USB  0x20                      // RWA, application force wake USB
#define  RB_SLP_WOL_WAKE    0x40                      // RWA, enable ethernet WOL waking
#define  RB_SLP_ETH_PWR_DN  0x80                      // RWA, enable power down for ethernet
#define R8_SLP_CTRL_PLL     (*((PUINT8V)0x0040000F))  // WA, PLL sleep control, SAM and write 0x6A to sleep CPU or write 0x95 to sleep PLL
#define R8_SLP_STATUS       (*((PUINT8V)0x0040000F))  // RO, sleep status
#define  RB_SLP_WOL_STATUS  0x01                      // RO, current ethernet WOL status
#define  RB_SLP_CPU_STATUS  0x40                      // RO, current CPU sleep status
#define  RB_SLP_PLL_STATUS  0x80                      // RO, current PLL sleep status

/* System: external bus configuration register */
#define R32_EXT_BUS_CFG     (*((PUINT32V)0x00400010)) // RW, external bus configuration
#define R8_XBUS_CONFIG      (*((PUINT8V)0x00400010))  // RW, external bus configuration
#define  RB_XBUS_ENABLE     0x01                      // RWA, external bus enable
#define  RB_XBUS_EN_32BIT   0x02                      // RW, enable 16bit or 32bit external bus
#define  RB_XBUS_ADDR_OE    0x0C                      // RWA, bus address output enable: 00=none,01=PA[5:0],10=PA[11:0],11=PA[19:0]
#define R8_XBUS_CYCLE       (*((PUINT8V)0x00400012))  // RW, external bus total cycle (clock number), only low 5 bit
#define R8_XBUS_SETUP_HOLD  (*((PUINT8V)0x00400013))  // RW, external bus setup and hold config
#define  RB_XBUS_HOLD       0x1F                      // RW, external bus hold time bit mask (clock number)
#define  RB_XBUS_SETUP      0x80                      // RW, external bus setup time: 0=1 clock, 1=2 clocks

/* System: parallel slave configuration register */
#define R32_PARA_SLV_CFG    (*((PUINT32V)0x00400014)) // RW, parallel slave configuration
#define R8_SLV_CONFIG       (*((PUINT8V)0x00400014))  // RWA, parallel slave configuration, SAM
#define  RB_SLV_ENABLE      0x01                      // RWA, parallel slave enable
#define  RB_SLV_IE_CMD      0x02                      // RWA, enable interrupt for slave writing command event
#define  RB_SLV_IE_WR       0x04                      // RWA, enable interrupt for slave writing event
#define  RB_SLV_IE_RD       0x08                      // RWA, enable interrupt for slave reading event
#define R8_SLV_DOUT         (*((PUINT8V)0x00400016))  // RW, parallel slave data to output
#define R8_SLV_STATUS       (*((PUINT8V)0x00400017))  // RW, parallel slave status to output, only low 7 bit

