Edragon/WCH/CH56x/official examples/CH563_SDCARD_FAT/CH563_SDCARD_FAT/SRC/CH563SFR.H
/* System: miscell control register */
#define R32_MISCELL_CTRL    (*((PUINT32V)0x0040001C)) // RW, miscell control
#define R8_MISC_CTRL_ETH    (*((PUINT8V)0x0040001C))  // RW, miscell control for ethernet
#define  RB_MISC_ETH_RX     0x01                      // RW, miscell control ethernet rx LED enable
#define  RB_MISC_ETH_TX     0x02                      // RW, miscell control ethernet tx LED enable
#define  RB_MISC_ETH_LED    0x04                      // RW, miscell control ethernet link LED enable
#define  RB_MISC_ETH_RST    0x80                      // RW, miscell control ethernet transceiver reset
#define R8_MISC_CTRL_USB    (*((PUINT8V)0x0040001D))  // RW, miscell control for USB
#define  RB_MISC_USB_VBUS   0x01                      // RW, miscell control USB OTG VBUS pin enable
#define  RB_MISC_USB_ID_EN  0x02                      // RW, miscell control USB OTG ID pin enable
#define  RB_MISC_USB_ID_ST  0x08                      // RW, miscell control USB OTG ID setting value
#define R8_MISC_CTRL_OTHER  (*((PUINT8V)0x0040001E))  // RW, miscell control for others
#define  RB_MISC_PECL_EN    0x01                      // RW, miscell control PECL input enable

/* Interrupt vector register */
#define R32_INT_VEC_CTRL    (*((PUINT32V)0x00400020)) // RWA, interrupt vector control, SAM
#define R8_INT_VEC_IRQ      (*((PUINT8V)0x00400020))  // RWA, IRQ normal interrupt vector control, SAM
#define  RB_IV_IRQ_TMR0     0x01                      // RWA, TMR0 IRQ vector enable
#define  RB_IV_IRQ_SPI0     0x02                      // RWA, SPI0 IRQ vector enable
#define  RB_IV_IRQ_PB       0x04                      // RWA, GPIO PB IRQ vector enable
#define R8_INT_VEC_FIQ      (*((PUINT8V)0x00400021))  // RWA, FIQ fast interrupt vector control, SAM
#define  RB_IV_FIQ_TMR0     0x01                      // RWA, TMR0 FIQ vector enable
#define  RB_IV_FIQ_SPI0     0x02                      // RWA, SPI0 FIQ vector enable
#define  RB_IV_FIQ_PB       0x04                      // RWA, GPIO PB FIQ vector enable
#define R32_INT_VEC_TMR0    (*((PUINT32V)0x00400024)) // RWA, interrupt vector for TMR0, SAM
#define R32_INT_VEC_SPI0    (*((PUINT32V)0x00400028)) // RWA, interrupt vector for SPI0, SAM
#define R32_INT_VEC_PB      (*((PUINT32V)0x0040002C)) // RWA, interrupt vector for GPIO PB, SAM

/* generate interrupt vector data */
#define MAKE_INT_VEC_IRQ( IrqHand )  (0xEA000000|((UINT32)IrqHand-0x20>>2))  // generate IRQ interrupt vector data
#define MAKE_INT_VEC_FIQ( FiqHand )  (0xEA000000|((UINT32)FiqHand-0x24>>2))  // generate FIQ interrupt vector data

/* Interrupt flag register */
#define R32_INT_FLAG        (*((PUINT32V)0x00400040)) // RW, interrupt flag

#define R8_INT_FLAG_0       (*((PUINT8V)0x00400040))  // RO, interrupt flag byte 0
#define  RB_IF_TMR0         0x01                      // RO, interrupt flag of TMR0
#define  RB_IF_TMR1         0x02                      // RO, interrupt flag of TMR1
#define  RB_IF_TMR2         0x04                      // RO, interrupt flag of TMR2
#define  RB_IF_TMR3         0x08                      // RO, interrupt flag of TMR3
#define  RB_IF_SPI0         0x10                      // RO, interrupt flag of SPI0
#define  RB_IF_SPI1         0x20                      // RO, interrupt flag of SPI1
#define  RB_IF_UART0        0x40                      // RO, interrupt flag of UART0
#define  RB_IF_UART1        0x80                      // RO, interrupt flag of UART1

#define R8_INT_FLAG_1       (*((PUINT8V)0x00400041))  // RO, interrupt flag byte 1
#define  RB_IF_PA           0x01                      // RO, interrupt flag of GPIO PA
#define  RB_IF_PB           0x02                      // RO, interrupt flag of GPIO PB
#define  RB_INT_WOL_STATUS  0x04                      // RO, current ethernet WOL status
#define  RB_IF_PD           0x08                      // RO, interrupt flag of GPIO PD
#define  RB_IF_ADC          0x10                      // RO, interrupt flag of ADC
#define  RB_IF_SLV          0x20                      // RO, interrupt flag of parallel slave
#define  RB_IF_USB          0x40                      // RO, interrupt flag of USB
#define  RB_IF_ETH          0x80                      // RO, interrupt flag of ethernet

#define R8_INT_FLAG_SLV     (*((PUINT8V)0x00400042))  // RW1, parallel slave interrupt flag
#define  RB_IF_SLV_CMD0     0x10                      // RO, parallel slave command raw flag
#define  RB_IF_SLV_CMD      0x20                      // RO, parallel slave command synchro flag
#define  RB_IF_SLV_WR       0x40                      // RW1, interrupt flag of parallel slave writing event
#define  RB_IF_SLV_RD       0x80                      // RW1, interrupt flag of parallel slave reading event
#define R8_INT_SLV_DIN      (*((PUINT8V)0x00400043))  // RO, parallel slave data input

/* IRQ interrupt enable register */
#define R32_INT_EN_IRQ      (*((PUINT32V)0x00400048)) // RW, IRQ interrupt enable
#define R8_INT_EN_IRQ_0     (*((PUINT8V)0x00400048))  // RW, IRQ interrupt enable byte 0
#define  RB_IE_IRQ_TMR0     0x01                      // RW, IRQ interrupt enable for TMR0
#define  RB_IE_IRQ_TMR1     0x02                      // RW, IRQ interrupt enable for TMR1
#define  RB_IE_IRQ_TMR2     0x04                      // RW, IRQ interrupt enable for TMR2
#define  RB_IE_IRQ_TMR3     0x08                      // RW, IRQ interrupt enable for TMR3
#define  RB_IE_IRQ_SPI0     0x10                      // RW, IRQ interrupt enable for SPI0
#define  RB_IE_IRQ_SPI1     0x20                      // RW, IRQ interrupt enable for SPI1
#define  RB_IE_IRQ_UART0    0x40                      // RW, IRQ interrupt enable for UART0
#define  RB_IE_IRQ_UART1    0x80                      // RW, IRQ interrupt enable for UART1
#define R8_INT_EN_IRQ_1     (*((PUINT8V)0x00400049))  // RW, IRQ interrupt enable byte 1
#define  RB_IE_IRQ_PA       0x01                      // RW, IRQ interrupt enable for GPIO PA
#define  RB_IE_IRQ_PB       0x02                      // RW, IRQ interrupt enable for GPIO PB
#define  RB_IE_IRQ_PD       0x08                      // RW, IRQ interrupt enable for GPIO PD
#define  RB_IE_IRQ_ADC      0x10                      // RW, IRQ interrupt enable for ADC
#define  RB_IE_IRQ_SLV      0x20                      // RW, IRQ interrupt enable for parallel slave
#define  RB_IE_IRQ_USB      0x40                      // RW, IRQ interrupt enable for USB
#define  RB_IE_IRQ_ETH      0x80                      // RW, IRQ interrupt enable for ethernet
#define R8_INT_EN_IRQ_GLOB  (*((PUINT8V)0x0040004B))  // RW, IRQ global interrupt enable
#define  RB_IE_IRQ_WOL      0x40                      // RW, IRQ interrupt enable for ethernet WOL, independent of global interrupt enable
#define  RB_IE_IRQ_GLOB     0x80                      // RW, IRQ global interrupt enable

