Edragon/WCH/CH56x/official examples/CH563_SDCARD_FAT/CH563_SDCARD_FAT/SRC/CH563SFR.H
#define R32_PB_SMT          (*((PUINT32V)0x004000BC)) // RW, GPIO PB output slew rate & input schmitt trigger: 0=fast,normal, 1=slow,schmitt
#define R8_PB_SMT_0         (*((PUINT8V)0x004000BC))  // RW, GPIO PB output slew rate & input schmitt trigger byte 0
#define R8_PB_SMT_1         (*((PUINT8V)0x004000BD))  // RW, GPIO PB output slew rate & input schmitt trigger byte 1
#define R8_PB_SMT_2         (*((PUINT8V)0x004000BE))  // RW, GPIO PB output slew rate & input schmitt trigger byte 2

/* GPIO PD register */
#define R32_PD_DIR          (*((PUINT32V)0x004000C0)) // RW, GPIO PD I/O direction: 0=in, 1=out
#define R8_PD_DIR_0         (*((PUINT8V)0x004000C0))  // RW, GPIO PD I/O direction byte 0
#define R8_PD_DIR_1         (*((PUINT8V)0x004000C1))  // RW, GPIO PD I/O direction byte 1
#define R8_PD_DIR_2         (*((PUINT8V)0x004000C2))  // RW, GPIO PD I/O direction byte 2
#define R8_PD_DIR_3         (*((PUINT8V)0x004000C3))  // RW, GPIO PD I/O direction byte 3
#define R32_PD_PIN          (*((PUINT32V)0x004000C4)) // RO, GPIO PD input
#define R8_PD_PIN_0         (*((PUINT8V)0x004000C4))  // RO, GPIO PD input byte 0
#define R8_PD_PIN_1         (*((PUINT8V)0x004000C5))  // RO, GPIO PD input byte 1
#define R8_PD_PIN_2         (*((PUINT8V)0x004000C6))  // RO, GPIO PD input byte 2
#define R8_PD_PIN_3         (*((PUINT8V)0x004000C7))  // RO, GPIO PD input byte 3
#define R32_PD_OUT          (*((PUINT32V)0x004000C8)) // RW, GPIO PD output
#define R8_PD_OUT_0         (*((PUINT8V)0x004000C8))  // RW, GPIO PD output byte 0
#define R8_PD_OUT_1         (*((PUINT8V)0x004000C9))  // RW, GPIO PD output byte 1
#define R8_PD_OUT_2         (*((PUINT8V)0x004000CA))  // RW, GPIO PD output byte 2
#define R8_PD_OUT_3         (*((PUINT8V)0x004000CB))  // RW, GPIO PD output byte 3
#define R32_PD_PU           (*((PUINT32V)0x004000D0)) // RW, GPIO PD pullup resistance enable
#define R8_PD_PU_0          (*((PUINT8V)0x004000D0))  // RW, GPIO PD pullup resistance enable 0
#define R8_PD_PU_1          (*((PUINT8V)0x004000D1))  // RW, GPIO PD pullup resistance enable 1
#define R8_PD_PU_2          (*((PUINT8V)0x004000D2))  // RW, GPIO PD pullup resistance enable 2
#define R8_PD_PU_3          (*((PUINT8V)0x004000D3))  // RW, GPIO PD pullup resistance enable 3
#define R32_PD_PD           (*((PUINT32V)0x004000D4)) // RW, GPIO PD pulldown resistance enable
#define R8_PD_PD_0          (*((PUINT8V)0x004000D4))  // RW, GPIO PD pulldown resistance enable 0
#define R8_PD_PD_1          (*((PUINT8V)0x004000D5))  // RW, GPIO PD pulldown resistance enable 1
#define R8_PD_PD_2          (*((PUINT8V)0x004000D6))  // RW, GPIO PD pulldown resistance enable 2
#define R8_PD_PD_3          (*((PUINT8V)0x004000D7))  // RW, GPIO PD pulldown resistance enable 3
#define R32_PD_DRV          (*((PUINT32V)0x004000D8)) // RW, GPIO PD driving capability: 0=4mA, 1=16mA
#define R8_PD_DRV           (*((PUINT8V)0x004000D8))  // RW, GPIO PD driving capability
#define R32_PD_SMT          (*((PUINT32V)0x004000DC)) // RW, GPIO PD output slew rate & input schmitt trigger: 0=fast,normal, 1=slow,schmitt
#define R8_PD_SMT           (*((PUINT8V)0x004000DC))  // RW, GPIO PD output slew rate & input schmitt trigger

/* GPIO register address offset and bit define */
#define BA_PA               ((PUINT8V)0x00400080)     // point GPIO PA base address
#define BA_PB               ((PUINT8V)0x004000A0)     // point GPIO PB base address
#define BA_PD               ((PUINT8V)0x004000C0)     // point GPIO PD base address
#define GPIO_DIR            0x00
#define GPIO_DIR_0          0x00
#define GPIO_DIR_1          0x01
#define GPIO_DIR_2          0x02
#define GPIO_DIR_3          0x03
#define GPIO_PIN            0x04
#define GPIO_PIN_0          0x04
#define GPIO_PIN_1          0x05
#define GPIO_PIN_2          0x06
#define GPIO_PIN_3          0x07
#define GPIO_OUT            0x08
#define GPIO_OUT_0          0x08
#define GPIO_OUT_1          0x09
#define GPIO_OUT_2          0x0A
#define GPIO_OUT_3          0x0B
#define GPIO_CLR            0x0C
#define GPIO_CLR_0          0x0C
#define GPIO_CLR_1          0x0D
#define GPIO_CLR_2          0x0E
#define GPIO_CLR_3          0x0F
#define GPIO_PU             0x10
#define GPIO_PU_0           0x10
#define GPIO_PU_1           0x11
#define GPIO_PU_2           0x12
#define GPIO_PU_3           0x13
#define GPIO_PD             0x14
#define GPIO_PD_0           0x14
#define GPIO_PD_1           0x15
#define GPIO_PD_2           0x16
#define GPIO_PD_3           0x17
#define GPIO_DRV            0x18
#define GPIO_DRV_0          0x18
#define GPIO_DRV_1          0x19
#define GPIO_DRV_2          0x1A
#define GPIO_SMT            0x1C
#define GPIO_SMT_0          0x1C
#define GPIO_SMT_1          0x1D
#define GPIO_SMT_2          0x1E
#define  RB_PD_15_8         0x01                      // RW, GPIO PD[15:8] pullup resistance enable together
#define  RB_PD_23_16        0x01                      // RW, GPIO PD[23:16] pullup resistance enable together
#define  RB_PD_31_24        0x01                      // RW, GPIO PD[31:24] pullup resistance enable together

/* GPIO alias name */
#define  TWP0               (1<<4)                    // PA4
#define  TWP1               (1<<5)                    // PA5
#define  TACK               (1<<6)                    // PA6
#define  TDO                (1<<7)                    // PA7
#define  TRST               (1<<9)                    // PA9
#define  TDI                (1<<13)                   // PA13
#define  TCK                (1<<14)                   // PA14
#define  TMS                (1<<15)                   // PA15
#define  UID                (1<<8)                    // PA8
#define  SLVI               (1<<9)                    // PA9
#define  SLVA               (1<<10)                   // PA10
#define  SLVCS              (1<<11)                   // PA11
#define  TNOW0              (1<<7)                    // PA7
#define  DTR0               (1<<7)                    // PA7
#define  RTS0               (1<<8)                    // PA8
#define  CTS0               (1<<12)                   // PA12
#define  DSR0               (1<<13)                   // PA13
#define  RI0                (1<<14)                   // PA14
#define  DCD0               (1<<15)                   // PA15
#define  CTS1               (1<<16)                   // PA16
#define  RTS1               (1<<17)                   // PA17
#define  TNOW1              (1<<17)                   // PA17
#define  ELED               (1<<13)                   // PA13
#define  ELINK              (1<<18)                   // PA18
#define  VBUS               (1<<19)                   // PA19
#define  PRD                (1<<20)                   // PA20
#define  PWR                (1<<21)                   // PA21
#define  CTS0X              (1<<0)                    // PB0
#define  DSR0X              (1<<1)                    // PB1
#define  RI0X               (1<<2)                    // PB2
#define  DCD0X              (1<<3)                    // PB3
#define  DTR0X              (1<<4)                    // PB4
#define  RTS0X              (1<<5)                    // PB5
#define  TRAN0              (1<<0)                    // PB0
#define  RECV0              (1<<1)                    // PB1
#define  TRAN1              (1<<2)                    // PB2
#define  RECV1              (1<<3)                    // PB3
#define  PWM0               (1<<0)                    // PB0
#define  CAT0               (1<<1)                    // PB1
/* note: PB1/CAT0 will input from PECL if RB_MISC_PECL_EN=1 and TMR0.RB_TMR_OUT_EN=1 */
#define  PWM1               (1<<2)                    // PB2
#define  CAT1               (1<<3)                    // PB3
#define  PWM2               (1<<4)                    // PB4
#define  CAT2               (1<<5)                    // PB5
#define  PWM3               (1<<6)                    // PB6
#define  CAT3               (1<<6)                    // PB6
#define  RXD0               (1<<8)                    // PB8
#define  TXD0               (1<<9)                    // PB9
#define  RXD1               (1<<10)                   // PB10
/* note: PB10/RXD1 will input from PECL if RB_MISC_PECL_EN=1 and TMR0.RB_TMR_OUT_EN=0 */
#define  RXTX1              (1<<10)                   // PB10
#define  TXD1               (1<<11)                   // PB11
#define  SCS                (1<<12)                   // PB12
#define  SCK0               (1<<13)                   // PB13
#define  MOSI               (1<<14)                   // PB14
#define  MISO               (1<<15)                   // PB15
#define  SDX0               (1<<15)                   // PB15
#define  ADCS               (1<<16)                   // PB16
#define  SCK1               (1<<17)                   // PB17
#define  SDO                (1<<18)                   // PB18
#define  SDI                (1<<19)                   // PB19
#define  SDX1               (1<<19)                   // PB19

