Edragon/WCH/CH56x/official examples/CH563_SDCARD_FAT/CH563_SDCARD_FAT/SRC/CH563SFR.H
/* ADC register */
#define R32_ADC_CONTROL     (*((PUINT32V)0x0040A000)) // RW, ADC control
#define R8_ADC_CTRL_MOD     (*((PUINT8V)0x0040A000))  // RW, ADC mode control
#define R8_ADC_CTRL_DMA     (*((PUINT8V)0x0040A001))  // RW, ADC DMA control and etc.
#define R8_ADC_INTER_EN     (*((PUINT8V)0x0040A002))  // RW, ADC interrupt enable
#define R8_ADC_CLOCK_DIV    (*((PUINT8V)0x0040A003))  // RW, ADC clock divisor
#define R32_ADC_STATUS      (*((PUINT32V)0x0040A004)) // RW, ADC status
#define R16_ADC_DATA        (*((PUINT16V)0x0040A004)) // RO, ADC result data
#define R8_ADC_INT_FLAG     (*((PUINT8V)0x0040A006))  // RW1, ADC interrupt flag
#define R8_ADC_FIFO_COUNT   (*((PUINT8V)0x0040A007))  // RO, ADC FIFO count status
#define R16_ADC_CMP_VALUE   (*((PUINT16V)0x0040A00C)) // RW, ADC comparison reference value
#define R16_ADC_FIFO        (*((PUINT16V)0x0040A010)) // RO, ADC FIFO register
#define R16_ADC_DMA_NOW     (*((PUINT16V)0x0040A014)) // RW, ADC DMA current address
#define R16_ADC_DMA_BEG     (*((PUINT16V)0x0040A018)) // RW, ADC DMA begin address
#define R16_ADC_DMA_END     (*((PUINT16V)0x0040A01C)) // RW, ADC DMA end address

/* ADC register address offset and bit define */
#define ADC_FIFO_SIZE       8                         // ADC FIFO size (depth)
#define BA_ADC              ((PUINT8V)0x0040A000)     // point ADC base address
#define ADC_CTRL_MOD        0
#define  RB_ADC_CYCLE_CLK   0x0F                      // RW, ADC cycle bit mask (clock number): 0=manual sample, other=set cycle for auto sample
#define  RB_ADC_CHAN_MOD    0x30                      // RW, ADC channel control mode: 00=0#, 01=1#, 10=2#, 11=auto flip 0#/1#
#define  RB_ADC_SAMPLE_WID  0x40                      // RW, ADC sample pulse width: 0=1 clock, 1=2 clock
#define  RB_ADC_POWER_ON    0x80                      // RW, ADC module enable
#define ADC_CTRL_DMA        1
#define  RB_ADC_DMA_ENABLE  0x01                      // RW, ADC DMA enable
#define  RB_ADC_DMA_BURST   0x02                      // RW, ADC DMA burst enable
#define  RB_ADC_DMA_LOOP    0x04                      // RW, ADC DMA address loop enable
#define  RB_ADC_CHAN_OE     0x40                      // WO, ADC channel control output enable
#define  RB_ADC_MAN_SAMPLE  0x80                      // RW, ADC manual sample control, high action
#define ADC_INTER_EN        2
#define  RB_ADC_IE_ADC_CMP  0x01                      // RW, enable interrupt for current ADC comparison action
#define  RB_ADC_IE_ADC_END  0x02                      // RW, enable interrupt for current ADC end
#define  RB_ADC_IE_FIFO_HF  0x04                      // RW, enable interrupt for ADC FIFO half
#define  RB_ADC_IE_DMA_END  0x08                      // RW, enable interrupt for ADC DMA completion
#define  RB_ADC_IE_FIFO_OV  0x10                      // RW, enable interrupt for ADC FIFO overflow
#define  RB_ADC_IE_DMA_ERR  0x20                      // RW, enable interrupt for ADC DMA respond error
#define  RB_ADC_CMP_MOD_EQ  0x40                      // RW, ADC equal comparison enable: 0=exclude equal, 1=include equal
#define  RB_ADC_CMP_MOD_GT  0x80                      // RW, ADC comparison mode: 0=less action, 1=great action
#define ADC_CLOCK_DIV       3
#define ADC_DATA            4
#define ADC_INT_FLAG        6
#define  RB_ADC_IF_ADC_CMP  0x01                      // RW1, interrupt flag for current ADC comparison action
#define  RB_ADC_IF_ADC_END  0x02                      // RW1, interrupt flag for current ADC end
#define  RB_ADC_IF_FIFO_HF  0x04                      // RW1, interrupt flag for ADC FIFO half
#define  RB_ADC_IF_DMA_END  0x08                      // RW1, interrupt flag for ADC DMA completion
#define  RB_ADC_IF_FIFO_OV  0x10                      // RW1, interrupt flag for ADC FIFO overflow
#define  RB_ADC_IF_DMA_ERR  0x20                      // RW1, interrupt flag for ADC DMA respond error
#define  RB_ADC_EOC_FLAG    0x40                      // RO, current ADC converter end indicator
#define  RB_ADC_CHAN_INDEX  0x80                      // RO, current ADC channel number for auto flip: 0=0#/2#, 1=1#
#define ADC_FIFO_COUNT      7
#define ADC_CMP_VALUE       0x0C
#define ADC_FIFO            0x10

/* UART0 register */
#define R8_UART0_RBR        (*((PUINT8V)0x0040D000))  // RO, UART0 receiver buffer, receiving byte
#define R8_UART0_THR        (*((PUINT8V)0x0040D000))  // WO, UART0 transmitter holding, transmittal byte
#define R8_UART0_IER        (*((PUINT8V)0x0040D001))  // RW, UART0 interrupt enable
#define R8_UART0_IIR        (*((PUINT8V)0x0040D002))  // RO, UART0 interrupt identification
#define R8_UART0_FCR        (*((PUINT8V)0x0040D002))  // WO, UART0 FIFO control
#define R8_UART0_LCR        (*((PUINT8V)0x0040D003))  // RW, UART0 line control
#define R8_UART0_MCR        (*((PUINT8V)0x0040D004))  // RW, UART0 modem control
#define R8_UART0_LSR        (*((PUINT8V)0x0040D005))  // RO, UART0 line status
#define R8_UART0_MSR        (*((PUINT8V)0x0040D006))  // RO, UART0 modem status
#define R8_UART0_DIV        (*((PUINT8V)0x0040D007))  // RW, UART0 pre-divisor latch byte, only low 7 bit, from 1 to 0/128
#define R8_UART0_DLL        (*((PUINT8V)0x0040D000))  // RW, UART0 divisor latch LSB byte
#define R8_UART0_DLM        (*((PUINT8V)0x0040D001))  // RW, UART0 divisor latch MSB byte

/* UART1 register */
#define R8_UART1_RBR        (*((PUINT8V)0x0040D800))  // RO, UART1 receiver buffer, receiving byte
#define R8_UART1_THR        (*((PUINT8V)0x0040D800))  // WO, UART1 transmitter holding, transmittal byte
#define R8_UART1_IER        (*((PUINT8V)0x0040D801))  // RW, UART1 interrupt enable
#define R8_UART1_IIR        (*((PUINT8V)0x0040D802))  // RO, UART1 interrupt identification
#define R8_UART1_FCR        (*((PUINT8V)0x0040D802))  // WO, UART1 FIFO control
#define R8_UART1_LCR        (*((PUINT8V)0x0040D803))  // RW, UART1 line control
#define R8_UART1_MCR        (*((PUINT8V)0x0040D804))  // RW, UART1 modem control
#define R8_UART1_LSR        (*((PUINT8V)0x0040D805))  // RO, UART1 line status
#define R8_UART1_MSR        (*((PUINT8V)0x0040D806))  // RO, UART1 modem status
#define R8_UART1_ADR        (*((PUINT8V)0x0040D807))  // RW, UART1 slave address: 0xFF=disable, other=enable
#define R8_UART1_DIV        (*((PUINT8V)0x0040D807))  // RW, UART1 pre-divisor latch byte, only low 7 bit, from 1 to 0/128
#define R8_UART1_DLL        (*((PUINT8V)0x0040D800))  // RW, UART1 divisor latch LSB byte
#define R8_UART1_DLM        (*((PUINT8V)0x0040D801))  // RW, UART1 divisor latch MSB byte

/* UART register address offset and bit define */
#define UART0_FIFO_SIZE     16                        // UART0 FIFO size (depth)
#define UART0_RECV_RDY_SZ   14                        // the max FIFO trigger level for UART0 receiver data available
#define UART1_FIFO_SIZE     32                        // UART1 FIFO size (depth)
#define UART1_RECV_RDY_SZ   28                        // the max FIFO trigger level for UART1 receiver data available
#define BA_UART0            ((PUINT8V)0x0040D000)     // point UART0 base address
#define BA_UART1            ((PUINT8V)0x0040D800)     // point UART1 base address
#define UART_RBR            0
#define UART_THR            0
#define UART_IER            1
#define  RB_IER_RECV_RDY    0x01                      // RW, UART interrupt enable for receiver data ready
#define  RB_IER_THR_EMPTY   0x02                      // RW, UART interrupt enable for THR empty
#define  RB_IER_LINE_STAT   0x04                      // RW, UART interrupt enable for receiver line status
#define  RB_IER_MODEM_CHG   0x08                      // RW, UART interrupt enable for modem status change
#define  RB_IER_MODEM_IO    0x10                      // RW, UART0 modem pin selection: 0=from/to GPIO PA, 1=from/to GPIO PB
#define  RB_IER_IRDA_MOD    0x10                      // RW, UART1 IrDA mode enable
#define  RB_IER_MOUT_EN     0x20                      // RW, UART modem output pin enable
#define  RB_IER_TXD_EN      0x40                      // RW, UART TXD pin enable
#define  RB_IER_RESET       0x80                      // WZ, UART software reset control, high action, auto clear
#define UART_IIR            2
#define  RB_IIR_NO_INT      0x01                      // RO, UART no interrupt flag: 0=interrupt action, 1=no interrupt
#define  RB_IIR_INT_MASK    0x0F                      // RO, UART interrupt flag bit mask
#define  RB_IIR_FIFO_ID     0xC0                      // RO, UART FIFO enabled flag
#define UART_FCR            2
#define  RB_FCR_FIFO_EN     0x01                      // WO, UART FIFO enable
#define  RB_FCR_RX_FIFO_CLR 0x02                      // WZ, clear UART receiver FIFO, high action, auto clear
#define  RB_FCR_TX_FIFO_CLR 0x04                      // WZ, clear UART transmitter FIFO, high action, auto clear
#define  RB_FCR_FIFO_TRIG   0xC0                      // WO, UART0/1 receiver FIFO trigger level: 00-1byte, 01-4/8bytes, 10-8/16bytes, 11-14/28bytes
#define UART_LCR            3
#define  RB_LCR_WORD_SZ     0x03                      // RW, UART word bit length: 00-5bit, 01-6bit, 10-7bit, 11-8bit
#define  RB_LCR_STOP_BIT    0x04                      // RW, UART stop bit length: 0-1bit, 1-2bit
#define  RB_LCR_PAR_EN      0x08                      // RW, UART parity enable
#define  RB_LCR_PAR_MOD     0x30                      // RW, UART pariry mode: 00-odd, 01-even, 10-mark, 11-space
#define  RB_LCR_BREAK_EN    0x40                      // RW, UART break control enable
#define  RB_LCR_DLAB        0x80                      // RW, UART divisor latch access bit
#define UART_MCR            4
#define  RB_MCR_DTR         0x01                      // RW, UART control DTR
#define  RB_MCR_RTS         0x02                      // RW, UART control RTS
#define  RB_MCR_OUT1        0x04                      // RW, UART control OUT1
#define  RB_MCR_OUT2        0x08                      // RW, UART control OUT2
#define  RB_MCR_LOOP        0x10                      // RW, UART0 enable local loop back
#define  RB_MCR_RXTX        0x10                      // RW, UART1 enable RXTX for half-duplex (TXD auto three-state output on RXD pin)
#define  RB_MCR_AU_FLOW_EN  0x20                      // RW, UART enable autoflow control
#define  RB_MCR_TNOW        0x40                      // RW, UART enable TNOW output on DTR or RTS pin
#define  RB_MCR_HALF        0x80                      // RW, UART enable half-duplex
#define UART_LSR            5
#define  RB_LSR_DATA_RDY    0x01                      // RO, UART receiver fifo data ready status
#define  RB_LSR_OVER_ERR    0x02                      // RZ, UART receiver overrun error
#define  RB_LSR_PAR_ERR     0x04                      // RZ, UART receiver parity error
#define  RB_LSR_FRAME_ERR   0x08                      // RZ, UART receiver frame error
#define  RB_LSR_BREAK_ERR   0x10                      // RZ, UART receiver break error
#define  RB_LSR_TX_FIFO_EMP 0x20                      // RO, UART transmitter fifo empty status
#define  RB_LSR_TX_ALL_EMP  0x40                      // RO, UART transmitter all empty status
#define  RB_LSR_ERR_RX_FIFO 0x80                      // RO, error in UART receiver fifo
#define UART_MSR            6
#define  RB_MSR_CTS_CHG     0x01                      // RZ, UART CTS changed status, high action
#define  RB_MSR_DSR_CHG     0x02                      // RZ, UART DSR changed status, high action
#define  RB_MSR_RI_CHG      0x04                      // RZ, UART RI changed status, high action
#define  RB_MSR_DCD_CHG     0x08                      // RZ, UART DCD changed status, high action
#define  RB_MSR_CTS         0x10                      // RO, UART CTS action status
#define  RB_MSR_DSR         0x20                      // RO, UART DSR action status
#define  RB_MSR_RI          0x40                      // RO, UART RI action status
#define  RB_MSR_DCD         0x80                      // RO, UART DCD action status
#define UART_ADR            7
#define UART_DIV            7
#define UART_DLL            0
#define UART_DLM            1

/* UART interrupt identification values for IIR bits 3:0 */
#define UART_II_SLV_ADDR    0x0E                      // RO, UART1 slave address match
#define UART_II_LINE_STAT   0x06                      // RO, UART interrupt by receiver line status
#define UART_II_RECV_RDY    0x04                      // RO, UART interrupt by receiver data available
#define UART_II_RECV_TOUT   0x0C                      // RO, UART interrupt by receiver fifo timeout
#define UART_II_THR_EMPTY   0x02                      // RO, UART interrupt by THR empty
#define UART_II_MODEM_CHG   0x00                      // RO, UART interrupt by modem status change
#define UART_II_NO_INTER    0x01                      // RO, no UART interrupt is pending

/* SPI0 register */
#define R32_SPI0_CONTROL    (*((PUINT32V)0x0040C000)) // RW, SPI0 control
#define R8_SPI0_CTRL_MOD    (*((PUINT8V)0x0040C000))  // RW, SPI0 mode control
#define R8_SPI0_CTRL_DMA    (*((PUINT8V)0x0040C001))  // RW, SPI0 DMA control
#define R8_SPI0_INTER_EN    (*((PUINT8V)0x0040C002))  // RW, SPI0 interrupt enable
#define R8_SPI0_CLOCK_DIV   (*((PUINT8V)0x0040C003))  // RW, SPI0 master clock divisor
#define R8_SPI0_SLAVE_PRE   (*((PUINT8V)0x0040C003))  // RW, SPI0 slave preset value
#define R32_SPI0_STATUS     (*((PUINT32V)0x0040C004)) // RW, SPI0 status
#define R8_SPI0_BUFFER      (*((PUINT8V)0x0040C004))  // RW, SPI0 data buffer
#define R8_SPI0_RUN_FLAG    (*((PUINT8V)0x0040C005))  // RO, SPI0 work flag
#define R8_SPI0_INT_FLAG    (*((PUINT8V)0x0040C006))  // RW1, SPI0 interrupt flag
#define R8_SPI0_FIFO_COUNT  (*((PUINT8V)0x0040C007))  // RO, SPI0 FIFO count status
#define R16_SPI0_TOTAL_CNT  (*((PUINT16V)0x0040C00C)) // RW, SPI0 total byte count, only low 12 bit
#define R32_SPI0_FIFO       (*((PUINT32V)0x0040C010)) // RW, SPI0 FIFO register
#define R8_SPI0_FIFO        (*((PUINT8V)0x0040C010))  // RO/WO, SPI0 FIFO register
#define R8_SPI0_FIFO_COUNT1 (*((PUINT8V)0x0040C013))  // RO, SPI0 FIFO count status
#define R16_SPI0_DMA_NOW    (*((PUINT16V)0x0040C014)) // RW, SPI0 DMA current address
#define R16_SPI0_DMA_BEG    (*((PUINT16V)0x0040C018)) // RW, SPI0 DMA begin address
#define R16_SPI0_DMA_END    (*((PUINT16V)0x0040C01C)) // RW, SPI0 DMA end address

/* SPI1 register */
#define R32_SPI1_CONTROL    (*((PUINT32V)0x0040C800)) // RW, SPI1 control
#define R8_SPI1_CTRL_MOD    (*((PUINT8V)0x0040C800))  // RW, SPI1 mode control
#define R8_SPI1_CTRL_DMA    (*((PUINT8V)0x0040C801))  // RW, SPI1 DMA control
#define R8_SPI1_INTER_EN    (*((PUINT8V)0x0040C802))  // RW, SPI1 interrupt enable
#define R8_SPI1_CLOCK_DIV   (*((PUINT8V)0x0040C803))  // RW, SPI1 master clock divisor
#define R32_SPI1_STATUS     (*((PUINT32V)0x0040C804)) // RW, SPI1 status
#define R8_SPI1_BUFFER      (*((PUINT8V)0x0040C804))  // RW, SPI1 data buffer
#define R8_SPI1_RUN_FLAG    (*((PUINT8V)0x0040C805))  // RO, SPI1 work flag
#define R8_SPI1_INT_FLAG    (*((PUINT8V)0x0040C806))  // RW1, SPI1 interrupt flag
#define R8_SPI1_FIFO_COUNT  (*((PUINT8V)0x0040C807))  // RO, SPI1 FIFO count status
#define R16_SPI1_TOTAL_CNT  (*((PUINT16V)0x0040C80C)) // RW, SPI1 total byte count, only low 12 bit
#define R32_SPI1_FIFO       (*((PUINT32V)0x0040C810)) // RW, SPI1 FIFO register
#define R8_SPI1_FIFO        (*((PUINT8V)0x0040C810))  // RO/WO, SPI1 FIFO register
#define R8_SPI1_FIFO_COUNT1 (*((PUINT8V)0x0040C813))  // RO, SPI1 FIFO count status

/* SPI register address offset and bit define */
#define SPI0_FIFO_SIZE      32                        // SPI0 FIFO size (depth)
#define SPI1_FIFO_SIZE      16                        // SPI1 FIFO size (depth)
#define BA_SPI0             ((PUINT8V)0x0040C000)     // point SPI0 base address
#define BA_SPI1             ((PUINT8V)0x0040C800)     // point SPI1 base address

#define SPI_CTRL_MOD        0
#define  RB_SPI_MODE_SLAVE  0x01                      // RW, SPI slave mode: 0=master/host, 1=slave/device
#define  RB_SPI_ALL_CLEAR   0x02                      // RW, force clear SPI FIFO and count
#define  RB_SPI_2WIRE_MOD   0x04                      // RW, SPI enable 2 wire mode: 0=3wire(SCK,MOSI,MISO), 1=2wire(SCK,MISO=SDX)
#define  RB_SPI_MST_SCK_MOD 0x08                      // RW, SPI master clock mode: 0=mode 0, 1=mode 3
#define  RB_SPI_SLV_CMD_MOD 0x08                      // RW, SPI slave command mode: 0=byte stream, 1=first byte command
#define  RB_SPI_FIFO_DIR    0x10                      // RW, SPI FIFO direction: 0=out(write @master mode), 1=in(read @master mode)
#define  RB_SPI_SCK_OE      0x20                      // RW, SPI SCK output enable
#define  RB_SPI_MOSI_OE     0x40                      // RW, SPI MOSI output enable
#define  RB_SPI1_SDO_OE     0x40                      // RW, SPI1 SDO output enable
#define  RB_SPI_MISO_OE     0x80                      // RW, SPI MISO output enable
#define  RB_SPI1_SDI_OE     0x80                      // RW, SPI1 SDI output enable, SPI1 enable 2 wire mode: 0=3wire(SCK1,SDO,SDI), 1=2wire(SCK1,SDX1)

