Edragon/WCH/CH56x/official examples/CH563_SDCARD_FAT/CH563_SDCARD_FAT/SRC/CH563SFR.H
#define SPI_CTRL_DMA        1
#define  RB_SPI_DMA_ENABLE  0x01                      // RW, SPI DMA enable
#define  RB_SPI_DMA_BURST   0x02                      // RW, SPI DMA burst enable
#define  RB_SPI_DMA_LOOP    0x04                      // RW, SPI DMA address loop enable

#define SPI_INTER_EN        2
#define  RB_SPI_IE_CNT_END  0x01                      // RW, enable interrupt for SPI total byte count end
#define  RB_SPI_IE_BYTE_END 0x02                      // RW, enable interrupt for SPI byte exchanged
#define  RB_SPI_IE_FIFO_HF  0x04                      // RW, enable interrupt for SPI FIFO half
#define  RB_SPI_IE_DMA_END  0x08                      // RW, enable interrupt for SPI DMA completion
#define  RB_SPI_IE_FIFO_OV  0x10                      // RW, enable interrupt for SPI FIFO overflow
#define  RB_SPI_IE_DMA_ERR  0x20                      // RW, enable interrupt for SPI DMA respond error
#define  RB_SPI_IE_FST_BYTE 0x80                      // RW, enable interrupt for SPI slave mode first byte received

#define SPI_CLOCK_DIV       3

#define SPI_SLAVE_PRESET    3

#define SPI_BUFFER          4

#define SPI_RUN_FLAG        5
#define  RB_SPI_SLV_CMD_ACT 0x10                      // RO, SPI slave command flag
#define  RB_SPI_FIFO_READY  0x20                      // RO, SPI FIFO ready status
#define  RB_SPI_SLV_CS_LOAD 0x40                      // RO, SPI slave chip-select loading status
#define  RB_SPI_SLV_SELECT  0x80                      // RO, SPI slave selection status

#define SPI_INT_FLAG        6
#define  RB_SPI_IF_CNT_END  0x01                      // RW1, interrupt flag for SPI total byte count end
#define  RB_SPI_IF_BYTE_END 0x02                      // RW1, interrupt flag for SPI byte exchanged
#define  RB_SPI_IF_FIFO_HF  0x04                      // RW1, interrupt flag for SPI FIFO half
#define  RB_SPI_IF_DMA_END  0x08                      // RW1, interrupt flag for SPI DMA completion
#define  RB_SPI_IF_FIFO_OV  0x10                      // RW1, interrupt flag for SPI FIFO overflow
#define  RB_SPI_IF_DMA_ERR  0x20                      // RW1, interrupt flag for SPI DMA respond error
#define  RB_SPI_FREE        0x40                      // RO, current SPI free status
#define  RB_SPI_IF_FST_BYTE 0x80                      // RW1, interrupt flag for SPI slave mode first byte received

#define SPI_FIFO_COUNT      7
#define SPI_TOTAL_CNT       0x0C
#define SPI_FIFO            0x10

/* Timer0 register */
#define R32_TMR0_CONTROL    (*((PUINT32V)0x00408000)) // RW, TMR0 control
#define R8_TMR0_CTRL_MOD    (*((PUINT8V)0x00408000))  // RW, TMR0 mode control
#define R8_TMR0_CTRL_DMA    (*((PUINT8V)0x00408001))  // RW, TMR0 DMA control
#define R8_TMR0_INTER_EN    (*((PUINT8V)0x00408002))  // RW, TMR0 interrupt enable
#define R8_TMR0_NRZI_CK_DIV (*((PUINT8V)0x00408003))  // RW, TMR0 NRZI clock divisor, only low 4 bit, from 0 to 15
#define R32_TMR0_STATUS     (*((PUINT32V)0x00408004)) // RW, TMR0 status
#define R8_TMR0_NRZI_STATUS (*((PUINT8V)0x00408004))  // RO, TMR0 NRZI status
#define R8_TMR0_INT_FLAG    (*((PUINT8V)0x00408006))  // RW1, TMR0 interrupt flag
#define R8_TMR0_FIFO_COUNT  (*((PUINT8V)0x00408007))  // RO, TMR0 FIFO count status
#define R32_TMR0_COUNT      (*((PUINT32V)0x00408008)) // RO, TMR0 current count
#define R16_TMR0_COUNT      (*((PUINT16V)0x00408008)) // RO, TMR0 current count
#define R8_TMR0_COUNT       (*((PUINT8V)0x00408008))  // RO, TMR0 current count
#define R32_TMR0_CNT_END    (*((PUINT32V)0x0040800C)) // RW, TMR0 end count value, only low 28 bit
#define R32_TMR0_FIFO       (*((PUINT32V)0x00408010)) // RO/WO, TMR0 FIFO register, only low 28 bit
#define R16_TMR0_FIFO       (*((PUINT16V)0x00408010)) // RO/WO, TMR0 FIFO register
#define R8_TMR0_FIFO        (*((PUINT8V)0x00408010))  // RO/WO, TMR0 FIFO register
#define R16_TMR0_DMA_NOW    (*((PUINT16V)0x00408014)) // RW, TMR0 DMA current address
#define R16_TMR0_DMA_BEG    (*((PUINT16V)0x00408018)) // RW, TMR0 DMA begin address
#define R16_TMR0_DMA_END    (*((PUINT16V)0x0040801C)) // RW, TMR0 DMA end address

/* Timer1 register */
#define R32_TMR1_CONTROL    (*((PUINT32V)0x00408400)) // RW, TMR1 control
#define R8_TMR1_CTRL_MOD    (*((PUINT8V)0x00408400))  // RW, TMR1 mode control
#define R8_TMR1_CTRL_DMA    (*((PUINT8V)0x00408401))  // RW, TMR1 DMA control
#define R8_TMR1_INTER_EN    (*((PUINT8V)0x00408402))  // RW, TMR1 interrupt enable
#define R8_TMR1_NRZI_CK_DIV (*((PUINT8V)0x00408403))  // RW, TMR1 NRZI clock divisor, only low 4 bit, from 0 to 15
#define R32_TMR1_STATUS     (*((PUINT32V)0x00408404)) // RW, TMR1 status
#define R8_TMR1_NRZI_STATUS (*((PUINT8V)0x00408404))  // RO, TMR1 NRZI status
#define R8_TMR1_INT_FLAG    (*((PUINT8V)0x00408406))  // RW1, TMR1 interrupt flag
#define R8_TMR1_FIFO_COUNT  (*((PUINT8V)0x00408407))  // RO, TMR1 FIFO count status
#define R32_TMR1_COUNT      (*((PUINT32V)0x00408408)) // RO, TMR1 current count
#define R16_TMR1_COUNT      (*((PUINT16V)0x00408408)) // RO, TMR1 current count
#define R8_TMR1_COUNT       (*((PUINT8V)0x00408408))  // RO, TMR1 current count
#define R32_TMR1_CNT_END    (*((PUINT32V)0x0040840C)) // RW, TMR1 end count value, only low 28 bit
#define R32_TMR1_FIFO       (*((PUINT32V)0x00408410)) // RO/WO, TMR1 FIFO register, only low 28 bit
#define R16_TMR1_FIFO       (*((PUINT16V)0x00408410)) // RO/WO, TMR1 FIFO register
#define R8_TMR1_FIFO        (*((PUINT8V)0x00408410))  // RO/WO, TMR1 FIFO register
#define R16_TMR1_DMA_NOW    (*((PUINT16V)0x00408414)) // RW, TMR1 DMA current address
#define R16_TMR1_DMA_BEG    (*((PUINT16V)0x00408418)) // RW, TMR1 DMA begin address
#define R16_TMR1_DMA_END    (*((PUINT16V)0x0040841C)) // RW, TMR1 DMA end address

/* Timer2 register */
#define R32_TMR2_CONTROL    (*((PUINT32V)0x00408800)) // RW, TMR2 control
#define R8_TMR2_CTRL_MOD    (*((PUINT8V)0x00408800))  // RW, TMR2 mode control
#define R8_TMR2_CTRL_DMA    (*((PUINT8V)0x00408801))  // RW, TMR2 DMA control
#define R8_TMR2_INTER_EN    (*((PUINT8V)0x00408802))  // RW, TMR2 interrupt enable
#define R32_TMR2_STATUS     (*((PUINT32V)0x00408804)) // RW, TMR2 status
#define R8_TMR2_INT_FLAG    (*((PUINT8V)0x00408806))  // RW1, TMR2 interrupt flag
#define R8_TMR2_FIFO_COUNT  (*((PUINT8V)0x00408807))  // RO, TMR2 FIFO count status
#define R32_TMR2_COUNT      (*((PUINT32V)0x00408808)) // RO, TMR2 current count
#define R16_TMR2_COUNT      (*((PUINT16V)0x00408808)) // RO, TMR2 current count
#define R8_TMR2_COUNT       (*((PUINT8V)0x00408808))  // RO, TMR2 current count
#define R32_TMR2_CNT_END    (*((PUINT32V)0x0040880C)) // RW, TMR2 end count value, only low 28 bit
#define R32_TMR2_FIFO       (*((PUINT32V)0x00408810)) // RO/WO, TMR2 FIFO register, only low 28 bit
#define R16_TMR2_FIFO       (*((PUINT16V)0x00408810)) // RO/WO, TMR2 FIFO register
#define R8_TMR2_FIFO        (*((PUINT8V)0x00408810))  // RO/WO, TMR2 FIFO register
#define R16_TMR2_DMA_NOW    (*((PUINT16V)0x00408814)) // RW, TMR2 DMA current address
#define R16_TMR2_DMA_BEG    (*((PUINT16V)0x00408818)) // RW, TMR2 DMA begin address
#define R16_TMR2_DMA_END    (*((PUINT16V)0x0040881C)) // RW, TMR2 DMA end address

/* Timer3 register */
#define R32_TMR3_CONTROL    (*((PUINT32V)0x00408C00)) // RW, TMR3 control
#define R8_TMR3_CTRL_MOD    (*((PUINT8V)0x00408C00))  // RW, TMR3 mode control
#define R8_TMR3_INTER_EN    (*((PUINT8V)0x00408C02))  // RW, TMR3 interrupt enable
#define R32_TMR3_STATUS     (*((PUINT32V)0x00408C04)) // RW, TMR3 status
#define R8_TMR3_INT_FLAG    (*((PUINT8V)0x00408C06))  // RW1, TMR3 interrupt flag
#define R8_TMR3_FIFO_COUNT  (*((PUINT8V)0x00408C07))  // RO, TMR3 FIFO count status
#define R32_TMR3_COUNT      (*((PUINT32V)0x00408C08)) // RO, TMR3 current count
#define R16_TMR3_COUNT      (*((PUINT16V)0x00408C08)) // RO, TMR3 current count
#define R8_TMR3_COUNT       (*((PUINT8V)0x00408C08))  // RO, TMR3 current count
#define R32_TMR3_CNT_END    (*((PUINT32V)0x00408C0C)) // RW, TMR3 end count value, only low 28 bit
#define R32_TMR3_FIFO       (*((PUINT32V)0x00408C10)) // RO/WO, TMR3 FIFO register, only low 28 bit
#define R16_TMR3_FIFO       (*((PUINT16V)0x00408C10)) // RO/WO, TMR3 FIFO register
#define R8_TMR3_FIFO        (*((PUINT8V)0x00408C10))  // RO/WO, TMR3 FIFO register

